def task1_a():
    country = {'Россия':'Москва', 'Сербия':'Белград', 'Греция':'Афины', 'Белоруссия':'Минск', 'Франция':'Париж', 'Финляндия':'Хнльсинки', 'Чехия':'Прага'}
    print (country)

def task1_b():
    country = {'Россия': 'Москва', 'Сербия': 'Белград', 'Греция': 'Афины', 'Белоруссия': 'Минск', 'Франция': 'Париж', 'Финляндия': 'Хнльсинки', 'Чехия': 'Прага'}
    print (country["Чехия"])

def task1_c():
    country = {'Россия': 'Москва', 'Сербия': 'Белград', 'Греция': 'Афины', 'Белоруссия': 'Минск', 'Франция': 'Париж', 'Финляндия': 'Хнльсинки', 'Чехия': 'Прага'}
    key = list (country.keys())
    key.sort()
    for i in key:
        print(i, ':', country[i])

def task2():
    point_1 = {'а', 'в', 'е', 'и', 'н', 'о', 'р', 'с', 'е'}
    point_2 = {'д', 'к', 'л', 'м', 'п', 'у'}
    point_3 = {'б', 'г', 'ё', 'ь', 'я'}
    point_4 = {'й', 'ы'}
    point_5 = {'ж', 'з', 'х', 'ц', 'ч'}
    point_8 = {'ш', 'э', 'ю'}
    point_10 = {'ф', 'щ', 'ъ'}
    word = list(input("Введите слово: "))
    k = 0
    for i in word:
        if i in point_1: k = k + 1
        if i in point_2: k = k + 2
        if i in point_3: k = k + 3
        if i in point_4: k = k + 4
        if i in point_5: k = k + 5
        if i in point_8: k = k + 8
        if i in point_10: k = k + 10
    print("Очков за слово:", k)

def task2_1():
    point = {'1 очко':['а', 'в', 'е', 'и', 'н', 'о', 'р', 'с', 'е'], '2 очка':['д', 'к', 'л', 'м', 'п', 'у'], '3 очка':['б', 'г', 'ё', 'ь', 'я'], '4 очка':['й', 'ы'], '5 очка':['ж', 'з', 'х', 'ц', 'ч'], '8 очков':['ш', 'э', 'ю'], '10 очков':['ф', 'щ', 'ъ']}

task2_1()